/*
Создайте класс рациональных чисел. Определите в нем конструктор, деструктор,
конструктор копирования Перегрузите операции + , - , * , / , = , операции ввода и
вывода. Перегрузите операцию приведения типов к вещественным числам и
комплексным числам.
*/

#include <iostream>
#include"RatioNum.h"

using namespace std;

int main()
{
    setlocale(LC_CTYPE, "rus");
    RatioNum a(1, 2), b(1, 3), c;
    cout << "---------------1--------------" << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl;
    cout << "Введите число в формате (числитьель, знаменатель)" << endl;
    cin >> b;
    c = 2 * a / b;
    cout << "---------------2--------------" << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl;
    c = c - a + b;
    cout << "---------------3--------------" << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl;

    cout << "---------------4--------------" << endl;
    cout << b.toReal() << endl;
    cout << "---------------5--------------" << endl;
    cout << b.toComplex() << endl;
}

