/*
Создать шаблонную очередь mydeque с использованием STL - контейнера vector
(например из двух векторов сделать одну очередь, так, что вставка в начало очереди – это
вставка в конец первого вектора, а вставка в конец очереди – вставка в конец второго
вектора).Определить в нем свои функции вставки в начало и в конец.
Инстанцировать для своего класса, представляющего строку, изготовленную из
vector<char>.
*/

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
