/*Базовый класс – массив чисел, производный класс – массив времен, представленных тройками 
* чисел : часы, минуты, секунды.
* Определите в нем конструктор, деструктор, конструктор копирования, оператор присваивания.
* Переопределите операции вставки, удаления элемента, переопределите операции[], +=, -=
*/

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}


